; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared1 - mode
	thermograph3 - mode
	image2 - mode
	thermograph0 - mode
	thermograph5 - mode
	spectrograph4 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph3)
	(supports instrument2 image2)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(have_image Star5 spectrograph4)
	(have_image Star6 spectrograph4)
	(have_image Star7 thermograph0)
	(have_image Phenomenon8 image2)
	(have_image Phenomenon8 infrared1)
	(have_image Star9 image2)
	(have_image Star10 image2)
))

)

; plan
1. (turn_to satellite1 star4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star4)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 7
5. (turn_to satellite0 groundstation3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 7
6. (take_image satellite1 phenomenon8 instrument2 image2)
   added: (have_image phenomenon8 image2)
   goals met: 1 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
8. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 7
9. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 7
10. (take_image satellite0 phenomenon8 instrument0 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 2 of 7
11. (turn_to satellite1 star10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star10)
   goals met: 2 of 7
12. (take_image satellite1 star10 instrument2 image2)
   added: (have_image star10 image2)
   goals met: 3 of 7
13. (turn_to satellite1 star5 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star5)
   goals met: 3 of 7
14. (take_image satellite1 star5 instrument2 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 4 of 7
15. (turn_to satellite1 star6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star6)
   goals met: 4 of 7
16. (take_image satellite1 star6 instrument2 spectrograph4)
   added: (have_image star6 spectrograph4)
   goals met: 5 of 7
17. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 5 of 7
18. (take_image satellite1 star7 instrument2 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 6 of 7
19. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 6 of 7
20. (take_image satellite1 star9 instrument2 image2)
   added: (have_image star9 image2)
   goals met: 7 of 7
